//
//  Strings.swift
//  Giftatte22
//
//  Created by duck on 2022/04/20.
//

import Foundation

//Main에서 사용될 문자열
struct Strings{

    static let collectTitleArray = ["50대 부모님 선물", "20대 여자 선물" , "20대 남자 선물" ,"최악의 선물 top3", "쓸모 없는 선물 top5"]
    static let collectContentsArray = "뭐가 필요한지 모르겠다면 Click!!!"
    
    
    //OnBoard CollectionView string 들
    static let groundLabelOne = ["50대 부모님","20대 여자","20대 남자","최악의 선물","조카 입학 선물"]
    static let groundLabelTwo = ["이런 선물을 좋아해요!","이런 선물을 좋아해요!","이런 선물을 좋아해요!","이건 절대 안돼요!","이걸로 하세요~!"]
    static let groundLabelThree = ["어버이날 최악의 선물은 카네이션! 역시 뭐니 뭐니 해도 부모님들께서 손 꼽는 선물은 현금이죠! 현금 다발, 봉투 준비하셨다면 이 세상 효녀 효자 등극입니다.그 밖에도 부모님 건강을 위한 건강식품이나 안마기는 어떨까요?", "흔한 선물이지만 그만큼 실패도 없는 주얼리류 선물입니다!20대 초반 중반 후반에 맞춰서 적절한 가격대의 주얼리를 선물해 보시는 건 어떨까요?그 밖에도 예쁜 텀블러나 시계도 손꼽는 선물입니다.화장품 선물 또한 나쁘지 않지만 호불호가 갈리니 주의하세요!","20대 남성이 특별한 날에 가장 받고 싶은 선물로 시계를 가장 많이 손꼽았습니다.패션에 관심이 많은 편이라면 티쏘 브랜드와 같은 클래식 시게,IT에 관심이 많은 편이라면 갤럭시워치,애플워치 등 스마트워치를 준비해도 좋을 것 같습니다.","보통 좋아하지 않아요 보통 좋아하지 않아요 보통 좋아하지 않아요 보통 좋아하지 않아요 보통 좋아하지 않아요 보통 좋아하지 않아요보통 좋아하지 않아요 보통 좋아하지 않아요 보통 좋아하지 않아요 보통 좋아하지 않아요 보통 좋아하지 않아요 보통 좋아하지 않아요 보통 좋아하지 않아요", "보통 좋아하지 않아요 보통 좋아하지 않아요 보통 좋아하지 않아요 보통 좋아하지 않아요 보통 좋아하지 않아요 보통 좋아하지 않아요보통 좋아하지 않아요 보통 좋아하지 않아요 보통 좋아하지 않아요 보통 좋아하지 않아요 보통 좋아하지 않아요 보통 좋아하지 않아요 보통 좋아하지 않아요"]
    static let groundLabelFour = ["50대 부모님 선물 TOP 5","20대 여자 선물 TOP 5","20대 남자 선물 TOP 5", "최악의 선물 TOP3", "최악의 선물 TOP3"]
    
}
